{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "./checkpoints/vicuna-7b-v1-5",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 256,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 128,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "o_proj",
    "gate_proj",
    "down_proj",
    "v_proj",
    "q_proj",
    "up_proj",
    "k_proj"
  ],
  "task_type": "CAUSAL_LM"
}